app/controllers/courses_controller.rb

	def index
		@courses=Course.all
---
SELECT "courses".* FROM "courses" WHERE (title like '%eco%')

	def create
		@course=Course.new()
		if @course.save
---
INSERT INTO "courses" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-04-09 16:34:16.928913"], ["updated_at", "2015-04-09 16:34:16.928913"]]

	def update
		@course=Course.find(params[:id])
		if @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "courses" SET "title" = ?, "teacher" = ?, "classroom" = ?, "time" = ?, "credit" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "economics 101"], ["teacher", "ben"], ["classroom", ""], ["time", "Tue234"], ["credit", ""], ["updated_at", "2015-04-09 17:03:10.943551"], ["id", 1]]